import { createStore } from 'vuex'

export default createStore({
  state: {
    restaurants: [
      {
        id: 1,
        title: 'Пицца плюс',
        rating: 4.5,
        bill: 'От 900 ₽',
        cousine: 'Пицца',
        menu: [
          {
            name: 'Ролл угорь стандарт',
            ingredients: 'Рис, угорь, соус унаги, кунжут, водоросли нори',
            price: 250
          },
          {
            name: 'Калифорния лосось стандарт',
            ingredients: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори',
            price: 395
          },
          {
            name: 'Окинава стандарт',
            ingredients: ' Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
            price: 250
          },
          {
            name: 'Цезарь маки хl',
            ingredients: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
            price: 250
          },
          {
            name: 'Ясай маки стандарт 185 г',
            ingredients: 'Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг',
            price: 250
          },
          {
            name: 'Ролл с креветкой стандарт',
            ingredients: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
            price: 250
          }
        ]
      },
      {
        id: 2,
        title: 'Тануки',
        rating: 4.5,
        bill: 'От 900 ₽',
        cousine: 'Пицца',
        menu: [
          {
            name: 'Ролл угорь стандарт',
            ingredients: 'Рис, угорь, соус унаги, кунжут, водоросли нори',
            price: 250
          },
          {
            name: 'Калифорния лосось стандарт',
            ingredients: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори',
            price: 395
          },
          {
            name: 'Окинава стандарт',
            ingredients: ' Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
            price: 250
          },
          {
            name: 'Цезарь маки хl',
            ingredients: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
            price: 250
          },
          {
            name: 'Ясай маки стандарт 185 г',
            ingredients: 'Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг',
            price: 250
          },
          {
            name: 'Ролл с креветкой стандарт',
            ingredients: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
            price: 250
          }
        ]
      },
      {
        id: 3,
        title: 'FoodBand',
        rating: 4.5,
        bill: 'От 900 ₽',
        cousine: 'Пицца',
        menu: [
          {
            name: 'Ролл угорь стандарт',
            ingredients: 'Рис, угорь, соус унаги, кунжут, водоросли нори',
            price: 250
          },
          {
            name: 'Калифорния лосось стандарт',
            ingredients: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори',
            price: 395
          },
          {
            name: 'Окинава стандарт',
            ingredients: ' Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
            price: 250
          },
          {
            name: 'Цезарь маки хl',
            ingredients: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
            price: 250
          },
          {
            name: 'Ясай маки стандарт 185 г',
            ingredients: 'Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг',
            price: 250
          },
          {
            name: 'Ролл с креветкой стандарт',
            ingredients: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
            price: 250
          }
        ]
      },
      {
        id: 4,
        title: 'Жадина-пицца',
        rating: 4.5,
        bill: 'От 900 ₽',
        cousine: 'Пицца',
        menu: [
          {
            name: 'Ролл угорь стандарт',
            ingredients: 'Рис, угорь, соус унаги, кунжут, водоросли нори',
            price: 250
          },
          {
            name: 'Калифорния лосось стандарт',
            ingredients: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори',
            price: 395
          },
          {
            name: 'Окинава стандарт',
            ingredients: ' Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
            price: 250
          },
          {
            name: 'Цезарь маки хl',
            ingredients: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
            price: 250
          },
          {
            name: 'Ясай маки стандарт 185 г',
            ingredients: 'Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг',
            price: 250
          },
          {
            name: 'Ролл с креветкой стандарт',
            ingredients: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
            price: 250
          }
        ]
      },
      {
        id: 5,
        title: 'Точка еды',
        rating: 4.5,
        bill: 'От 900 ₽',
        cousine: 'Пицца',
        menu: [
          {
            name: 'Ролл угорь стандарт',
            ingredients: 'Рис, угорь, соус унаги, кунжут, водоросли нори',
            price: 250
          },
          {
            name: 'Калифорния лосось стандарт',
            ingredients: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори',
            price: 395
          },
          {
            name: 'Окинава стандарт',
            ingredients: ' Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
            price: 250
          },
          {
            name: 'Цезарь маки хl',
            ingredients: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
            price: 250
          },
          {
            name: 'Ясай маки стандарт 185 г',
            ingredients: 'Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг',
            price: 250
          },
          {
            name: 'Ролл с креветкой стандарт',
            ingredients: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
            price: 250
          }
        ]
      },
      {
        id: 6,
        title: 'PizzaBurger',
        rating: 4.5,
        bill: 'От 900 ₽',
        cousine: 'Пицца',
        menu: [
          {
            name: 'Ролл угорь стандарт',
            ingredients: 'Рис, угорь, соус унаги, кунжут, водоросли нори',
            price: 250
          },
          {
            name: 'Калифорния лосось стандарт',
            ingredients: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори',
            price: 395
          },
          {
            name: 'Окинава стандарт',
            ingredients: ' Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
            price: 250
          },
          {
            name: 'Цезарь маки хl',
            ingredients: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
            price: 250
          },
          {
            name: 'Ясай маки стандарт 185 г',
            ingredients: 'Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг',
            price: 250
          },
          {
            name: 'Ролл с креветкой стандарт',
            ingredients: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
            price: 250
          }
        ]
      }
    ],
  },
  getters: {
    getRestaurantsByRating(state) {
      return state.restaurants.sort((a, b) => b.rating - a.rating);
    },
  },
  mutations: {

  },
  actions: {
    updateRestaurant({ commit }, { restaurantId, updates }) {
      commit('updateRestaurant', { restaurantId, updates });
    },
  },
  modules: {

  }
})
